// 原码，反码，补码
// 原码：符号位加上真值的绝对值，即用第一位表示符号，正数用0表示，负数用1表示，其余位表示值。
// 反码：正数的反码是其本身；负数的反码是在其原码的基础上，符号位不变，其余各位取反。
// 补码：正数的补码就是其本身；负数的补码是在其原码的基础上，符号位不变，其余各位取反，最后+1。
// 数据类型
// int 取值范围：-2147483648~2147483647 位数：32位 -2的31次方 - 2的31次方 - 1
// long 取值范围：-2147483648~2147483647    位数：32位
// long long 取值范围：-9223372036854775808~9223372036854775807 位数：64位
// float 取值范围：-3.4E+38~3.4E+38 位数：32位
// double 取值范围：-1.7E+308~1.7E+308  位数：64位
// long double 取值范围：-1.7E+308~1.7E+308 位数：64位
// char 取值范围：-128~127  位数：8位

// unsigned 只存放非负数
// unsigned int 取值范围：0~4294967295  位数：32位
// unsigned long 取值范围：0~4294967295 位数：32位
// unsigned long long 取值范围：0~18446744073709551615  位数：64位
// unsigned char 取值范围：0~255    位数：8位
#include<bits/stdc++.h>
using namespace std;
int main()
{
    int a[100];
    // 检测数据类型的大小
    cout<<sizeof(a);
    // 定义一个值为3.14的常量，pi没有数据类型
    #define PI 3.1415926
    // 或者
    const double pi = 3.1415926;
    // 定义一些有趣的东西
    #define ll long long
    // 变量的命名规则
    // 1.变量名只能由字母、数字和下划线组成
    // 2.变量名不能以数字开头
    // 3.变量名不能是C++的关键字
    // 4.变量名不能是C++的保留字
    // 5.变量名不能是C++的内置标识符
    // 0x开头的是十六进制数
    // 0开头的是八进制数
    // 0b开头的是二进制数
    int b = 32767;
    short int c = b+1;
    cout<<c;
    cout<<c-1<<endl;
    float d = 111111.111;
    double e = 111111.111;
    // printf d和e
    printf("%f\n",d);
    printf("%lf",e);
    // 转义字符
    // \a 响铃
    // \b 退格
    // \f 换页
    // \n 换行
    // \r 回车
    // \t 水平制表符
    // \v 垂直制表符
    // \\ 反斜杠
    // \' 单引号
    // \" 双引号
    // \ddd 1到3位八进制数所代表的任意字符(从八进制解码到其他进制，如\376 = 3*8*8 + 7*8 + 6 = 254)
    // \xhh 1到2位十六进制数所代表的任意字符

}